luhui_embedded_linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Human" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgf198c5a" class="outline-2">
<h2 id="orgf198c5a">个人简介</h2>
<div class="outline-text-2" id="text-orgf198c5a">
<p>
姓名: 路辉
</p>

<p>
电邮: gravitydiv10@protonmail.com
</p>

<p>
博客: <a href="https://gravitydiv10.github.io">https://gravitydiv10.github.io</a>
</p>
</div>
</div>

<div id="outline-container-org10d900d" class="outline-2">
<h2 id="org10d900d">专业技能</h2>
<div class="outline-text-2" id="text-org10d900d">
<ol class="org-ol">
<li>熟悉Linux内核驱动的移植和调试，包括网络, 显示, USB, 存储，文件系统等</li>

<li>熟悉Linux用户空间的应用编写，使用C/Shell/Tcl/Asm/Forth编程语言</li>

<li>熟悉buildroot/openwrt/yocto等嵌入式系统交叉编译框架</li>

<li>熟悉各种Linux发行版打包移植，包括ArchLinux, Debian, GNU Guix, NixOS</li>

<li>熟悉uboot驱动的移植和调试，包括SPL, 串口, I2C, 网络, MMC, SPI</li>

<li>熟悉笔记本EC单片机固件的编写, 包括 低功耗, 充电管理, 键盘扫描, RTC, 看门狗</li>

<li>熟悉计算机底层架构，操作系统原理，通信协议，网络协议，安全加固，逆向破解。</li>

<li>熟悉万用表，示波器，逻辑分析仪，协议分析仪等硬件调试工具。</li>

<li>熟悉各种协议外设的移植调试: USB, MIPI DSI, MIPI CSI, SDIO, SPI, I2C, UART, MDIO</li>
</ol>
</div>
</div>

<div id="outline-container-orgc5b2124" class="outline-2">
<h2 id="orgc5b2124">项目经历</h2>
<div class="outline-text-2" id="text-orgc5b2124">
</div>
<div id="outline-container-org1360d5a" class="outline-3">
<h3 id="org1360d5a">LicheeConsole4A LicheePocket4A LicheeCluster4A LicheePi4A MaixCam LicheeRvNano</h3>
<div class="outline-text-3" id="text-org1360d5a">
<p>
项目主页: <a href="https://wiki.sipeed.com/">https://wiki.sipeed.com/</a>
</p>

<p>
Lichee*4A 系列使用平头哥TH1520芯片的国产RISCV笔记本/掌机/集群板/开发板，运行PLCT实验室提供的RevyOS。
</p>

<p>
MaixCam LicheeRvNano系列使用算能SG2002的国产RISCV AI相机/视觉开发板，运行Buildroot Linux。
</p>

<ol class="org-ol">
<li>协助硬件进行电路板设计，调试，迭代，压力测试，功能验证。</li>

<li>调通电路板上的所有外设，移植/编写驱动到Linux内核。</li>

<li>修复用户空间/内核中的稳定性问题。</li>

<li>编写笔记本主板EC固件，以及Linux端的驱动代码。</li>

<li>移植适配OpenBMC，运行在集群板的控制器。</li>

<li>设计生产烧录方案，产品测试方案的流程以及代码。</li>

<li>整理驱动代码，定期提交到上游(RevyOS)</li>

<li>对客户的技术支持</li>
</ol>
</div>
</div>

<div id="outline-container-org35379ee" class="outline-3">
<h3 id="org35379ee">LonganPi 3H</h3>
<div class="outline-text-3" id="text-org35379ee">
<p>
全志H618芯片ARM开发板，运行Debian和Linux主线内核。
</p>

<p>
职责同上
</p>
</div>
</div>

<div id="outline-container-org72b68bb" class="outline-3">
<h3 id="org72b68bb">全志V853</h3>
<div class="outline-text-3" id="text-org72b68bb">
<p>
全志V853芯片ARM AI视觉开发板，运行OpenWrt。
</p>

<p>
职责同上
</p>
</div>
</div>

<div id="outline-container-org6b3adc8" class="outline-3">
<h3 id="org6b3adc8">VoCore2</h3>
<div class="outline-text-3" id="text-org6b3adc8">
<p>
项目主页 <a href="https://vocore.io/">https://vocore.io/</a>
</p>

<p>
联发科MT7628 Wifi模块，运行主线OpenWrt
</p>

<ol class="org-ol">
<li>协助硬件进行物料更换测试，新物料的主线Uboot/Linux驱动适配。</li>

<li>移植厂家的驱动代码到主线内核/用户空间</li>

<li>设计生产烧录方案，产品压力测试的流程以及代码。</li>

<li>编写Linux用户空间应用</li>

<li>解决国外客户使用中的各种技术问题</li>
</ol>
</div>
</div>

<div id="outline-container-orgf596be4" class="outline-3">
<h3 id="orgf596be4">VoCore2 Screen</h3>
<div class="outline-text-3" id="text-orgf596be4">
<p>
使用普通USB接口(USB BULK)的显示屏
</p>

<ol class="org-ol">
<li>验证新的芯片替代方案，进行压力测试以及DEMO编写</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org1cc282a" class="outline-2">
<h2 id="org1cc282a">工作经历</h2>
<div class="outline-text-2" id="text-org1cc282a">
<p>
2022.07 ~ 2023.04 太原微铬电子科技有限公司 Linux软件开发
</p>

<p>
2023.05 ~ 至今    深圳矽速科技有限公司 Linux BSP系统工程师
</p>
</div>
</div>

<div id="outline-container-org5e31699" class="outline-2">
<h2 id="org5e31699">开源项目</h2>
<div class="outline-text-2" id="text-org5e31699">
</div>
<div id="outline-container-org35651e0" class="outline-3">
<h3 id="org35651e0">qemu</h3>
<div class="outline-text-3" id="text-org35651e0">
<p>
在自己的分支添加了MT7628,F1C100S等芯片的模拟
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2024-05-08</p>
</div>
</body>
</html>
